From Atƒ±l Samancƒ±oƒülu's Course : Data Science and Machine Learning 

-> Pandas Library üêº

Jay Alammar Web Link : https://jalammar.github.io/gentle-visual-intro-to-data-analysis-python-pandas/

In [1]:
import numpy as np
import pandas as pd

In [2]:
grades = {"Atƒ±l" : 50 , "James" : 60, "Lars" : 30}

In [3]:
pd.Series(grades)

Atƒ±l     50
James    60
Lars     30
dtype: int64

In [4]:
names = ["Atƒ±l", "James", "Lars"]
grades = [50, 60, 30]

In [5]:
pd.Series(names)

0     Atƒ±l
1    James
2     Lars
dtype: object

In [6]:
pd.Series(grades)

0    50
1    60
2    30
dtype: int64

In [7]:
pd.Series(grades, names)

Atƒ±l     50
James    60
Lars     30
dtype: int64

In [8]:
pd.Series(data = grades, index = names)

Atƒ±l     50
James    60
Lars     30
dtype: int64

Pandas With NumPy

In [9]:
numpy_array = np.array([50, 40, 30, 20])

In [10]:
pd.Series(numpy_array)

0    50
1    40
2    30
3    20
dtype: int64

Arithmetic

In [11]:
contest_result = pd.Series(data = [10,5,100], index = ["Atƒ±l", "James", "Lars"])
contest_result2 = pd.Series(data = [20,50,10], index = ["Atƒ±l", "James", "Lars"])

In [12]:
contest_result

Atƒ±l      10
James      5
Lars     100
dtype: int64

In [13]:
contest_result["Atƒ±l"]

np.int64(10)

In [14]:
contest_result2["James"]

np.int64(50)

In [15]:
final_result = contest_result + contest_result2
final_result

Atƒ±l      30
James     55
Lars     110
dtype: int64

In [16]:
contest_result - contest_result2

Atƒ±l    -10
James   -45
Lars     90
dtype: int64

In [17]:
contest_result * contest_result2

Atƒ±l      200
James     250
Lars     1000
dtype: int64

In [18]:
contest_result / contest_result2

Atƒ±l      0.5
James     0.1
Lars     10.0
dtype: float64

In [19]:
contest_result ** contest_result2

Atƒ±l     7766279631452241920
James   -6776596920136667815
Lars     7766279631452241920
dtype: int64

In [20]:
contest_result // contest_result2

Atƒ±l      0
James     0
Lars     10
dtype: int64

In [21]:
different_series = pd.Series([20,30,40,50],["a","b","c","d"])

In [22]:
different_series2 = pd.Series([10,5,3,1],["a","c","f","g"])

In [23]:
different_series + different_series2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

Introduction to DataFrame

In [24]:
import numpy as np
import pandas as pd

In [25]:
data = np.random.randn(4,3)

In [26]:
data

array([[-0.86204892, -0.61072325, -0.3602186 ],
       [ 0.41981636, -1.15224449,  0.82797846],
       [ 1.47112306, -1.94737299, -1.34442586],
       [-1.99175772,  0.82045374,  0.05563311]])

In [27]:
data_frame = pd.DataFrame(data)
data_frame

          0         1         2
0 -0.862049 -0.610723 -0.360219
1  0.419816 -1.152244  0.827978
2  1.471123 -1.947373 -1.344426
3 -1.991758  0.820454  0.055633

In [28]:
type(data_frame)

pandas.core.frame.DataFrame

In [29]:
data_frame[0]

0   -0.862049
1    0.419816
2    1.471123
3   -1.991758
Name: 0, dtype: float64

In [30]:
type(data_frame[0])

pandas.core.series.Series

In [31]:
new_df = pd.DataFrame(data, index = ["Atil","Zeynep","Atlas","Mehmet"], columns = ["Salary", "Age", "Seniority"])
new_df

          Salary       Age  Seniority
Atil   -0.862049 -0.610723  -0.360219
Zeynep  0.419816 -1.152244   0.827978
Atlas   1.471123 -1.947373  -1.344426
Mehmet -1.991758  0.820454   0.055633

In [32]:
new_df["Salary"]

Atil     -0.862049
Zeynep    0.419816
Atlas     1.471123
Mehmet   -1.991758
Name: Salary, dtype: float64

In [33]:
new_df["Age"]

Atil     -0.610723
Zeynep   -1.152244
Atlas    -1.947373
Mehmet    0.820454
Name: Age, dtype: float64

In [34]:
new_df[["Age","Salary"]]

             Age    Salary
Atil   -0.610723 -0.862049
Zeynep -1.152244  0.419816
Atlas  -1.947373  1.471123
Mehmet  0.820454 -1.991758

In [35]:
new_df.loc["Atil"]

Salary      -0.862049
Age         -0.610723
Seniority   -0.360219
Name: Atil, dtype: float64

In [36]:
new_df.iloc[0]

Salary      -0.862049
Age         -0.610723
Seniority   -0.360219
Name: Atil, dtype: float64

In [37]:
new_df

          Salary       Age  Seniority
Atil   -0.862049 -0.610723  -0.360219
Zeynep  0.419816 -1.152244   0.827978
Atlas   1.471123 -1.947373  -1.344426
Mehmet -1.991758  0.820454   0.055633

In [38]:
new_df.iloc[:,2]

Atil     -0.360219
Zeynep    0.827978
Atlas    -1.344426
Mehmet    0.055633
Name: Seniority, dtype: float64

In [39]:
new_df["Age"]

Atil     -0.610723
Zeynep   -1.152244
Atlas    -1.947373
Mehmet    0.820454
Name: Age, dtype: float64

In [40]:
new_df["Extra"] = 10

In [41]:
new_df

          Salary       Age  Seniority  Extra
Atil   -0.862049 -0.610723  -0.360219     10
Zeynep  0.419816 -1.152244   0.827978     10
Atlas   1.471123 -1.947373  -1.344426     10
Mehmet -1.991758  0.820454   0.055633     10

In [42]:
new_df.drop("Extra", axis = 1)

          Salary       Age  Seniority
Atil   -0.862049 -0.610723  -0.360219
Zeynep  0.419816 -1.152244   0.827978
Atlas   1.471123 -1.947373  -1.344426
Mehmet -1.991758  0.820454   0.055633

In [43]:
new_df

          Salary       Age  Seniority  Extra
Atil   -0.862049 -0.610723  -0.360219     10
Zeynep  0.419816 -1.152244   0.827978     10
Atlas   1.471123 -1.947373  -1.344426     10
Mehmet -1.991758  0.820454   0.055633     10

In [44]:
new_df = new_df.drop("Extra" , axis = 1)

In [45]:
new_df

          Salary       Age  Seniority
Atil   -0.862049 -0.610723  -0.360219
Zeynep  0.419816 -1.152244   0.827978
Atlas   1.471123 -1.947373  -1.344426
Mehmet -1.991758  0.820454   0.055633

In [46]:
new_df["Extra"] = 10

In [47]:
new_df

          Salary       Age  Seniority  Extra
Atil   -0.862049 -0.610723  -0.360219     10
Zeynep  0.419816 -1.152244   0.827978     10
Atlas   1.471123 -1.947373  -1.344426     10
Mehmet -1.991758  0.820454   0.055633     10

In [48]:
new_df.drop("Extra", axis = 1 , inplace = True)

In [49]:
new_df

          Salary       Age  Seniority
Atil   -0.862049 -0.610723  -0.360219
Zeynep  0.419816 -1.152244   0.827978
Atlas   1.471123 -1.947373  -1.344426
Mehmet -1.991758  0.820454   0.055633

In [50]:
new_df

          Salary       Age  Seniority
Atil   -0.862049 -0.610723  -0.360219
Zeynep  0.419816 -1.152244   0.827978
Atlas   1.471123 -1.947373  -1.344426
Mehmet -1.991758  0.820454   0.055633

In [51]:
new_df.drop("Mehmet", axis = 0)

          Salary       Age  Seniority
Atil   -0.862049 -0.610723  -0.360219
Zeynep  0.419816 -1.152244   0.827978
Atlas   1.471123 -1.947373  -1.344426

In [52]:
new_df.loc["Atlas"]

Salary       1.471123
Age         -1.947373
Seniority   -1.344426
Name: Atlas, dtype: float64

In [53]:
new_df.loc["Atlas"]["Salary"]

np.float64(1.471123061678557)

In [54]:
new_df.loc["Atlas","Salary"]

np.float64(1.471123061678557)

In [55]:
new_df.loc["Atlas","Salary"] = 100

In [56]:
new_df

            Salary       Age  Seniority
Atil     -0.862049 -0.610723  -0.360219
Zeynep    0.419816 -1.152244   0.827978
Atlas   100.000000 -1.947373  -1.344426
Mehmet   -1.991758  0.820454   0.055633

In [57]:
new_df > 0

        Salary    Age  Seniority
Atil     False  False      False
Zeynep    True  False       True
Atlas     True  False      False
Mehmet   False   True       True

In [58]:
boolean_frame = new_df > 0

In [59]:
boolean_frame

        Salary    Age  Seniority
Atil     False  False      False
Zeynep    True  False       True
Atlas     True  False      False
Mehmet   False   True       True

In [60]:
new_df[boolean_frame]

            Salary       Age  Seniority
Atil           NaN       NaN        NaN
Zeynep    0.419816       NaN   0.827978
Atlas   100.000000       NaN        NaN
Mehmet         NaN  0.820454   0.055633

In [61]:
new_df[new_df > 0]

            Salary       Age  Seniority
Atil           NaN       NaN        NaN
Zeynep    0.419816       NaN   0.827978
Atlas   100.000000       NaN        NaN
Mehmet         NaN  0.820454   0.055633

In [62]:
new_df[new_df["Salary"] > 1]

       Salary       Age  Seniority
Atlas   100.0 -1.947373  -1.344426

In [63]:
new_df[new_df["Age"] > 1]

Empty DataFrame
Columns: [Salary, Age, Seniority]
Index: []

DataFrame Index

In [64]:
new_df.reset_index()

    index      Salary       Age  Seniority
0    Atil   -0.862049 -0.610723  -0.360219
1  Zeynep    0.419816 -1.152244   0.827978
2   Atlas  100.000000 -1.947373  -1.344426
3  Mehmet   -1.991758  0.820454   0.055633

In [65]:
reset_frame = new_df.reset_index()

In [66]:
reset_frame

    index      Salary       Age  Seniority
0    Atil   -0.862049 -0.610723  -0.360219
1  Zeynep    0.419816 -1.152244   0.827978
2   Atlas  100.000000 -1.947373  -1.344426
3  Mehmet   -1.991758  0.820454   0.055633

In [67]:
new_indices = ["Ati","Zey","Atl","Meh"]

In [68]:
new_df["NewIndex"] = new_indices

In [69]:
new_df

            Salary       Age  Seniority NewIndex
Atil     -0.862049 -0.610723  -0.360219      Ati
Zeynep    0.419816 -1.152244   0.827978      Zey
Atlas   100.000000 -1.947373  -1.344426      Atl
Mehmet   -1.991758  0.820454   0.055633      Meh

In [70]:
new_df.set_index("NewIndex", inplace = True)

In [71]:
new_df

              Salary       Age  Seniority
NewIndex
Ati        -0.862049 -0.610723  -0.360219
Zey         0.419816 -1.152244   0.827978
Atl       100.000000 -1.947373  -1.344426
Meh        -1.991758  0.820454   0.055633

Multi Index

In [72]:
first_index = ["Simpson","Simpson","Simpson","South Park", "South Park","South Park"]

In [73]:
inner_index = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [74]:
zipped_index = list(zip(first_index,inner_index))

In [75]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [76]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [77]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [78]:
sample_values = np.ones((6,2))

In [79]:
big_df = pd.DataFrame(sample_values, index = zipped_index , columns = ["Age", "Salary"] )

In [80]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

This file ended, keep going with part 2...